app/controllers/comments_controller.rb

  def show_upvoted_comments
    user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    if @format == "json"
      request.format = :json
    end
    if @user.nil?
      respond_to do |format|
        format.html { redirect_to :contributions, notice: 'You need to be logged in to create a comment', status: :unauthorized }
        format.json {
          render json: {
            error: "user not found",
            status: :unauthorized
          }, status: :unauthorized
        }
      end
    else
      @comment = @user.comments.create(comment_params)
      @contribution = Contribution.find(@comment.contribution_id)
      respond_to do |format|
        if @comment.save
          format.html { redirect_to @contribution }
          format.json { render json: @comment, status: :created }
        else
          format.html { render :new , alert: @comment.errors.full_messages.join(', ') }
---
INSERT INTO "comments" ("text", "user_id", "created_at", "updated_at", "contribution_id") VALUES (?, ?, ?, ?, ?)  [["text", "Segundo comentario"], ["user_id", "1"], ["created_at", "2021-10-23 17:07:35.631629"], ["updated_at", "2021-10-23 17:07:35.631629"], ["contribution_id", "1"]]
SELECT "contributions".* FROM "contributions" WHERE "contributions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "contributions".* FROM "contributions"

  def update
    @contribution = @contribution.find(@comment.contribution_id)
---
SELECT "contributions".* FROM "contributions" WHERE "contributions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    respond_to do |format|
      if @comment.nil?
        format.html { redirect_to :contributions, notice: 'Comment not found', status: :not_found }
        format.json {
          render json:{
            error: "Comment not found",
          }, status: :not_found
        }
      elsif @user.nil? || @user.id.to_s != @comment.user_id.to_s
        @contribution = Contribution.find(@comment.contribution_id)
        format.html { redirect_to @contribution, notice: 'You need to be logged in to destroy a comment', status: :unauthorized }
        format.json {
          render json: {
            error: "user not found",
            status: :unauthorized
          }, status: :unauthorized
        }
      else
        @contribution = Contribution.find(@comment.contribution_id)
        @comment.destroy
---
SELECT "contributions".* FROM "contributions" WHERE "contributions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 319127946], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 980190962]]