app/controllers/comments_controller.rb

INSERT INTO "comments" ("text", "user_id", "created_at", "updated_at", "contribution_id") VALUES (?, ?, ?, ?, ?)  [["text", "Texto contribucion"], ["user_id", "2"], ["created_at", "2021-10-25 17:35:00.072615"], ["updated_at", "2021-10-25 17:35:00.072615"], ["contribution_id", "1"]]
---
  def create
    @comment = current_user.comments.create(comment_params)