app/controllers/contributions_controller.rb

  def index
    @contributions = Contribution.where(contribution_type: "url").order(points: :desc)
---
SELECT "contributions".* FROM "contributions" WHERE "contributions"."contribution_type" = ? ORDER BY "contributions"."points" DESC  [["contribution_type", "url"]]

  def show_news
    @contributions = Contribution.all.order(created_at: :desc)
---
SELECT "contributions".* FROM "contributions" ORDER BY "contributions"."created_at" DESC

  def create

    #TODO: change this to redirect if user is not logged in
    ################################################################

    ################################################################

    @contribution = ContributionServices::CreateContributionService.new(contribution_params).call
    puts @contribution.inspect
    puts current_user.inspect
    current_user.contributions << @contribution

    respond_to do |format|
      if current_user.save
---
INSERT INTO "contributions" ("url", "text", "title", "user_id", "created_at", "updated_at", "contribution_type") VALUES (?, ?, ?, ?, ?, ?, ?)  [["url", "uaoeu"], ["text", ""], ["title", "uaeuaoeu"], ["user_id", "1"], ["created_at", "2021-10-25 16:47:57.090646"], ["updated_at", "2021-10-25 16:47:57.090646"], ["contribution_type", "url"]]
UPDATE "contributions" SET "text" = ?, "updated_at" = ? WHERE "contributions"."id" = ?  [["text", "https://stackoverflow.com/questions/16721816/how-do-i-defined-a-variable-link-to-to-an-external-url"], ["updated_at", "2021-10-14 19:59:44.655889"], ["id", 1]]
INSERT INTO "contributions" ("url", "text", "title", "user_id", "created_at", "updated_at", "contribution_type") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @contribution.update(contribution_params)
---
UPDATE "contributions" SET "text" = ?, "updated_at" = ? WHERE "contributions"."id" = ?  [["text", "https://stackoverflow.com/questions/16721816/how-do-i-defined-a-variable-link-to-to-an-external-url"], ["updated_at", "2021-10-14 19:59:44.655889"], ["id", 1]]

    def set_contribution
      @contribution = Contribution.find(params[:id])
---
SELECT "contributions".* FROM "contributions" WHERE "contributions"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]